doc/html/handlers/crash.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Crash Handler</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Crash Handler"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-11-12 19:50:41 CST"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="../stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Crash Handler</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html"><b>Handlers</b></a> | <a href="../config.html">Configuration Options</a> | <a href="./advanced.html">Advanced Guides</a> | <a href="../troubleshooting.html">Troubleshooting</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Crash Handler</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Crash Handler</h2>
<div class="outline-text-2" id="text-1">


<p>
  The crash handler provides a simple mechanism for dealing with page crashes
  to provide more user-friendly notifications, as well as giving the programmer
  the ability to hook whatever kind of logging they want into errors.
</p>
<p>
  The previous functionality in Nitrogen, when a page simply crashed, was to
  return "Internal Server Error" and send a 500 error to the client.  This,
  unfortunately, results in a big scary white page with a useless error message
  for the connected client, or in the case of AJAX, silently failing (buttons
  that do nothing, and the user thinks "Hey, maybe it's just running slowly",
  when in fact, it's crashed.
</p>
<p>
  The crash handler allows you to present a template to the user, wire events,
  and overall present something more useful (or at the very least, more
  friendly) to your customer (for example, presenting a formatted page saying
  "Sorry, something has gone awry, we've been notified and are looking into
  the problem").
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Behavior Functions</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-5">
<h5 id="sec-1-1-1"><span class="section-number-5"></span> <code>init(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-1">


<p>
  Initialize the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code> 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-5">
<h5 id="sec-1-1-2"><span class="section-number-5"></span> <code>finish(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-2">


<p>
  Clean up the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-3" class="outline-5">
<h5 id="sec-1-1-3"><span class="section-number-5"></span> <code>first_request(ErrorType, Error, Stacktrace, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-3">


<p>  
  If the client's request was a "first request" (not a postback, comet,
  or websocket request), this will be called with the Error information.
</p>
<ul>
<li><code>ErrorType</code> - This is merely the error type retrieved from the class
     portion of a <code>catch</code> statement, typically this will simply be <code>error</code>,
     or it could be <code>throw</code> if it's a programmer-thrown error, or <code>exit</code> if the
     process called <code>exit/1</code>

</li>
<li><code>Error</code> - This will be the more descriptive nature of the error, for
     example <code>badarg</code> or <code>{badmatch, V}</code>. See
     <a href="http://erlang.org/doc/reference_manual/errors.html">Errors and Error Handling Section 10.4</a>
     for more descriptions of the error.

</li>
<li><code>Stacktrace</code> - This will be the result of calling <code>erlang:stack_trace/0</code>
     at the time of the error.

</li>
<li><code>Config</code> - Any configuration associated with the crash handler.

</li>
<li><code>State</code> - Any state information associated with the crash handler
     (likely unused).

</li>
<li><i>Return Value</i> - The body to be sent to the browser.
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4"></span> <code>postback_request(ErrorType, Error, Stacktrace, Config, State)</code></h4>
<div class="outline-text-4" id="text-1-1-1">


<p>
    If the client's request was a an AJAX, Comet, Websocket, or other
    non-initial request, this function will be called.
</p>
<p>
    It takes all the same arguments, but the return value is discarded, hence
    the recommendation to simply return <code>ok</code>.
</p>
<p>
    Instead, anything you wire to the browser will be sent. This could allow
    you to send a simple, useful little alert box to the user saying "We're
    sorry, there was an issue processing this request, please try again or
    reload the page". At least then the user will get <b>some</b> kind of feedback
    and not just silently failing.
</p>
</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Example</h3>
<div class="outline-text-3" id="text-1-2">


<p>
  Here is the complete text of the default crash handler, which is simple, and
  for production use, is probably too simple, but it demonstrates the most basic
  form of crash handler.
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span>(default_crash_handler).
<span class="org-preprocessor">-behaviour</span>(crash_handler).
<span class="org-preprocessor">-include</span>(<span class="org-string">"wf.hrl"</span>).
<span class="org-preprocessor">-export</span>([
    <span class="org-type">init/2</span>,
    <span class="org-type">finish/2</span>,
    <span class="org-type">first_request/5</span>,
    <span class="org-type">postback_request/5</span>
]).

<span class="org-erlang-font-lock-exported-function-name">init</span>(<span class="org-variable-name">_Config</span>,<span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-erlang-font-lock-exported-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-erlang-font-lock-exported-function-name">first_request</span>(<span class="org-variable-name">Type</span>, <span class="org-variable-name">Error</span>, <span class="org-variable-name">Stacktrace</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-comment-delimiter">%% </span><span class="org-comment">Print the error message to the Erlang console</span>
    ?<span class="org-constant">LOG</span>(<span class="org-string">"~p~n"</span>, [{error, <span class="org-variable-name">Type</span>, <span class="org-variable-name">Error</span>, <span class="org-variable-name">Stacktrace</span>}]),

    <span class="org-comment-delimiter">%% </span><span class="org-comment">Set the response status code to 500 (internal server error)</span>
    <span class="org-type">wf</span>:<span class="org-type">status_code</span>(500),

    <span class="org-comment-delimiter">%% </span><span class="org-comment">Send just the text "Internal Server Error" with no formatting or layout</span>
    <span class="org-string">"Internal Server Error"</span>.

<span class="org-erlang-font-lock-exported-function-name">postback_request</span>(<span class="org-variable-name">Type</span>, <span class="org-variable-name">Error</span>, <span class="org-variable-name">Stacktrace</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-comment-delimiter">%% </span><span class="org-comment">Print the error message to the Erlang console</span>
    ?<span class="org-constant">LOG</span>(<span class="org-string">"~p~n"</span>, [{error, <span class="org-variable-name">Type</span>, <span class="org-variable-name">Error</span>, <span class="org-variable-name">Stacktrace</span>}]),

    <span class="org-comment-delimiter">%% </span><span class="org-comment">Set the status code to 500 (internal server error)</span>
    <span class="org-type">wf</span>:<span class="org-type">status_code</span>(500),

    <span class="org-comment-delimiter">%% </span><span class="org-comment">Do nothing else</span>
    ok.

</pre>


<p>
  A more useful example would be a crash handler that uses a template and pops
  a message to the user when a postback is used.
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span>(simple_crash_handler).
<span class="org-preprocessor">-behaviour</span>(crash_handler).
<span class="org-preprocessor">-include_lib</span>(<span class="org-string">"nitrogen_core/include/wf.hrl"</span>).
<span class="org-preprocessor">-export</span>([
    <span class="org-type">init/2</span>,
    <span class="org-type">finish/2</span>,
    <span class="org-type">first_request/5</span>,
    <span class="org-type">postback_request/5</span>,
    <span class="org-type">body/1</span>
]).

<span class="org-erlang-font-lock-exported-function-name">init</span>(<span class="org-variable-name">_Config</span>,<span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-erlang-font-lock-exported-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-erlang-font-lock-exported-function-name">first_request</span>(<span class="org-variable-name">Type</span>, <span class="org-variable-name">Error</span>, <span class="org-variable-name">Stacktrace</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-comment-delimiter">%% </span><span class="org-comment">Print the error message to the Erlang console</span>
    ?<span class="org-constant">LOG</span>(<span class="org-string">"~p~n"</span>, [{error, <span class="org-variable-name">Type</span>, <span class="org-variable-name">Error</span>, <span class="org-variable-name">Stacktrace</span>}]),

    <span class="org-comment-delimiter">%% </span><span class="org-comment">Set the response status code to 500 (internal server error)</span>
    <span class="org-type">wf</span>:<span class="org-type">status_code</span>(500),

    #<span class="org-type">template</span>{
      file=<span class="org-string">"./site/templates/error.html"</span>,
      bindings=[{<span class="org-string">'Stacktrace'</span>, <span class="org-variable-name">Stacktrace</span>}],
      module_aliases=[{page,?<span class="org-constant">MODULE</span>}]
    }.

<span class="org-comment-delimiter">%% </span><span class="org-comment">This is assuming that the error.html template includes a call to [[[page:body(Stacktrace)]]]</span>
<span class="org-erlang-font-lock-exported-function-name">body</span>(<span class="org-variable-name">Stacktrace</span>) -&gt;
    [
      #<span class="org-type">h1</span>{text=<span class="org-string">"UH OH! Something went wrong!"</span>},
      #<span class="org-type">panel</span>{text=<span class="org-type">wf</span>:<span class="org-type">f</span>(<span class="org-string">"Here's the contents of the error: ~p"</span>,[<span class="org-variable-name">Stacktrace</span>])}
    ].


<span class="org-erlang-font-lock-exported-function-name">postback_request</span>(<span class="org-variable-name">Type</span>, <span class="org-variable-name">Error</span>, <span class="org-variable-name">Stacktrace</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-comment-delimiter">%% </span><span class="org-comment">Print the error message to the Erlang console</span>
    ?<span class="org-constant">LOG</span>(<span class="org-string">"~p~n"</span>, [{error, <span class="org-variable-name">Type</span>, <span class="org-variable-name">Error</span>, <span class="org-variable-name">Stacktrace</span>}]),

    <span class="org-comment-delimiter">%% </span><span class="org-comment">Note, we don't set the status code to 500. If we did, the browser will</span>
    <span class="org-comment-delimiter">%% </span><span class="org-comment">simply discard any javascript. So we keep a 200 status code and print</span>
    <span class="org-comment-delimiter">%% </span><span class="org-comment">a friendlier error message.</span>

    <span class="org-variable-name">Msg</span> = <span class="org-type">wf</span>:<span class="org-type">f</span>(<span class="org-string">"I'm sorry, but there was an error. Here's the stack trace: ~p"</span>,[<span class="org-variable-name">Stacktrace</span>]),
    <span class="org-type">wf</span>:<span class="org-type">wire</span>(#<span class="org-type">alert</span>{text=<span class="org-variable-name">Msg</span>}).

</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> Recommendations for first requests</h3>
<div class="outline-text-3" id="text-1-3">


<p>
   It's very likely that for handling first requests, you'll want to display a
   template to the user, rather than simple raw text or hand rolled HTML.
</p>
<p>
   In that event, it's probably very likely you'll want to redirect requests
   to the standard <code>page</code> module to the crash handler module (or a custom crash
   module). This is done with the <code>module_aliases</code> attribute on the <code>#template</code>
   element. This is especially useful if you want to use the same template for
   your errors that you might use with the rest of the page.
</p>
<p>
   If you plan on sending any of the arguments passed to <code>first_request/5</code> to
   a template, make sure you take advantage of the <code>bindings</code> attribute.
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3"></span> Recommendations for postback requests</h3>
<div class="outline-text-3" id="text-1-4">


<p>
   If you want to gracefully handle crashes related to postbacks, comets, etc,
   then you need to make sure you do <b>not</b> set the status_code to a failure
   code (like 500). You might as well keep it as the default 200, and then wire
   whatever commands you wish.
</p>
<p>
   At the very least, we recommend giving the user <b>some</b> kind of feedback,
   even if it's a simple javascript alert (See Alert Action below).
</p>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3"></span> What if your handler crashes?</h3>
<div class="outline-text-3" id="text-1-5">


<p>
   If your custom crash handler crashes, then Nitrogen will fall back to its
   default behavior of throwing a 500 error and returning "Internal Server
   Error".
</p>
<p>
   It's recommended that, much like Erlang supervisors, that your crash handler
   modules be very simple, with minimal moving parts, so as to prevent this from
   happening. For example: It's probably not a great idea to hinge your crash
   handler to database availability, unless you verify with the <code>ErrorType</code> and
   <code>Error</code> arguments that the error is not related to database availability.
</p>
<p>
   Using those arguments, you can custom tailor the error messages to certain
   classes and show different templates or content depending on the message.
</p>
<p>
   But the simplest error template should just be a mostly static HTML template
   that probably doesn't even make an page calls. That will ensure that your
   crash handler doesn't crash, effectively negating its existence.
</p>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-6">


<ul>
<li><a href="../handlers.html">Handler Overview</a>

</li>
<li><a href="../elements/template.html">Template Element</a>

</li>
<li><a href="../actions/alert.html">Alert Action</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-11-12 19:50:41 CST</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/handlers/crash.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
